interFoam/campagneNonUniformDiss/D050L474W045Z000Hup123Hdown094Q060_leer/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
       type             calculated;
       value           uniform 0;
    }
    /*
    outlet
    {
        type    calculated;
        value   uniform 0;

    }
	*/
    
	outletWater
    {
        type            calculated;
        value           uniform 0;
    }
	
	outletAir
    {
        type            calculated;
        value           uniform 0;
    }
    
	
	top
    {
        type            calculated;
        value           uniform 0;
    }
	
    //"(bottom|frontAndBack)"//|cylinder)"
    "(obstacle|frontAndBack)"
    {
        type            nutkWallFunction; 
	    value		    uniform 0;
    }
    bottom
    {
        type            nutkWallFunction; 
	    value		    uniform 0;
        
        //type            nutkRoughWallFunction; 
	    //value		    uniform 0;
        //Ks              uniform 1.8e-3;
        //Cs              uniform 1;
        
    }

}


// ************************************************************************* //
