interFoam/campagneNonUniformDiss/D050L474W045Z000Hup123Hdown094Q060_leer/0.orig/startBC/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

//inletVelocity		    0.3; // m/s
inletFlowRate           0.06; // m3/s
pressureHeight        922; // = rho*g*h = 1000*9.81*0,094[m]
kInlet                  8E-07;
kLowRe                  1E-10; //4.14e-03;
kHighRe                 5.45E-03;
//turbulentEpsilon      0.00001; //4.39e-05;
omegaLowRe		4.34E+07;
omegaHighRe             3.58E-01;
omegaInlet              87.99;

// ************************************************************************* //
